MikroElektronika/core_packages/PIC/XC8/def/PIC16F785/mcu.h
extern volatile IOCbits_t IOCbits __at(0x096);
// bitfield macros
#define _IOC_IOCA0_POSN                                     0x0
#define _IOC_IOCA0_POSITION                                 0x0
#define _IOC_IOCA0_SIZE                                     0x1
#define _IOC_IOCA0_LENGTH                                   0x1
#define _IOC_IOCA0_MASK                                     0x1
#define _IOC_IOCA1_POSN                                     0x1
#define _IOC_IOCA1_POSITION                                 0x1
#define _IOC_IOCA1_SIZE                                     0x1
#define _IOC_IOCA1_LENGTH                                   0x1
#define _IOC_IOCA1_MASK                                     0x2
#define _IOC_IOCA2_POSN                                     0x2
#define _IOC_IOCA2_POSITION                                 0x2
#define _IOC_IOCA2_SIZE                                     0x1
#define _IOC_IOCA2_LENGTH                                   0x1
#define _IOC_IOCA2_MASK                                     0x4
#define _IOC_IOCA3_POSN                                     0x3
#define _IOC_IOCA3_POSITION                                 0x3
#define _IOC_IOCA3_SIZE                                     0x1
#define _IOC_IOCA3_LENGTH                                   0x1
#define _IOC_IOCA3_MASK                                     0x8
#define _IOC_IOCA4_POSN                                     0x4
#define _IOC_IOCA4_POSITION                                 0x4
#define _IOC_IOCA4_SIZE                                     0x1
#define _IOC_IOCA4_LENGTH                                   0x1
#define _IOC_IOCA4_MASK                                     0x10
#define _IOC_IOCA5_POSN                                     0x5
#define _IOC_IOCA5_POSITION                                 0x5
#define _IOC_IOCA5_SIZE                                     0x1
#define _IOC_IOCA5_LENGTH                                   0x1
#define _IOC_IOCA5_MASK                                     0x20
#define _IOC_IOC0_POSN                                      0x0
#define _IOC_IOC0_POSITION                                  0x0
#define _IOC_IOC0_SIZE                                      0x1
#define _IOC_IOC0_LENGTH                                    0x1
#define _IOC_IOC0_MASK                                      0x1
#define _IOC_IOC1_POSN                                      0x1
#define _IOC_IOC1_POSITION                                  0x1
#define _IOC_IOC1_SIZE                                      0x1
#define _IOC_IOC1_LENGTH                                    0x1
#define _IOC_IOC1_MASK                                      0x2
#define _IOC_IOC2_POSN                                      0x2
#define _IOC_IOC2_POSITION                                  0x2
#define _IOC_IOC2_SIZE                                      0x1
#define _IOC_IOC2_LENGTH                                    0x1
#define _IOC_IOC2_MASK                                      0x4
#define _IOC_IOC3_POSN                                      0x3
#define _IOC_IOC3_POSITION                                  0x3
#define _IOC_IOC3_SIZE                                      0x1
#define _IOC_IOC3_LENGTH                                    0x1
#define _IOC_IOC3_MASK                                      0x8
#define _IOC_IOC4_POSN                                      0x4
#define _IOC_IOC4_POSITION                                  0x4
#define _IOC_IOC4_SIZE                                      0x1
#define _IOC_IOC4_LENGTH                                    0x1
#define _IOC_IOC4_MASK                                      0x10
#define _IOC_IOC5_POSN                                      0x5
#define _IOC_IOC5_POSITION                                  0x5
#define _IOC_IOC5_SIZE                                      0x1
#define _IOC_IOC5_LENGTH                                    0x1
#define _IOC_IOC5_MASK                                      0x20

// Register: REFCON
#define REFCON REFCON
extern volatile unsigned char           REFCON              __at(0x098);
#ifndef _LIB_BUILD
asm("REFCON equ 098h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CVROE                  :1;
        unsigned VROE                   :1;
        unsigned VREN                   :1;
        unsigned VRBB                   :1;
        unsigned BGST                   :1;
    };
} REFCONbits_t;
extern volatile REFCONbits_t REFCONbits __at(0x098);
// bitfield macros
#define _REFCON_CVROE_POSN                                  0x1
#define _REFCON_CVROE_POSITION                              0x1
#define _REFCON_CVROE_SIZE                                  0x1
#define _REFCON_CVROE_LENGTH                                0x1
#define _REFCON_CVROE_MASK                                  0x2
#define _REFCON_VROE_POSN                                   0x2
#define _REFCON_VROE_POSITION                               0x2
#define _REFCON_VROE_SIZE                                   0x1
#define _REFCON_VROE_LENGTH                                 0x1
#define _REFCON_VROE_MASK                                   0x4
#define _REFCON_VREN_POSN                                   0x3
#define _REFCON_VREN_POSITION                               0x3
#define _REFCON_VREN_SIZE                                   0x1
#define _REFCON_VREN_LENGTH                                 0x1
#define _REFCON_VREN_MASK                                   0x8
#define _REFCON_VRBB_POSN                                   0x4
#define _REFCON_VRBB_POSITION                               0x4
#define _REFCON_VRBB_SIZE                                   0x1
#define _REFCON_VRBB_LENGTH                                 0x1
#define _REFCON_VRBB_MASK                                   0x10
#define _REFCON_BGST_POSN                                   0x5
#define _REFCON_BGST_POSITION                               0x5
#define _REFCON_BGST_SIZE                                   0x1
#define _REFCON_BGST_LENGTH                                 0x1
#define _REFCON_BGST_MASK                                   0x20

// Register: VRCON
#define VRCON VRCON
extern volatile unsigned char           VRCON               __at(0x099);
#ifndef _LIB_BUILD
asm("VRCON equ 099h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VR0                    :1;
        unsigned VR1                    :1;
        unsigned VR2                    :1;
        unsigned VR3                    :1;
        unsigned                        :1;
        unsigned VRR                    :1;
        unsigned C2VREN                 :1;
        unsigned C1VREN                 :1;
    };
} VRCONbits_t;
